// -----------------------------------------------------------------------------------------
// 📌 강의내용중 중요부분 체크
// ⭐️ 집중하자 집중을
// -----------------------------------------------------------------------------------------
// - 
// -----------------------------------------------------------------------------------------

import React from 'react';
import NewMeeupForm from '../components/meetups/NewMeeupForm';

const NewMeetup = () => {
    return (
        <div>
            <h1>Add New Meetup</h1>
            <NewMeeupForm/>
        </div>
    );
};

export default NewMeetup;