// -----------------------------------------------------------------------------------------
// 📌 강의내용중 중요부분 체크
// ⭐️ 집중하자 집중을
// -----------------------------------------------------------------------------------------
// - wrapper 컴포넌트이다.
// - props.children은 모든 컴포넌트가 기본값을 얻게하는 특별한 프로퍼티
// - 그러면 item.js에서 묶은 안에 내용들이 (props를 통해)이곳으로 들어온다. 즉 컴포넌트로 ui를 구성할수있음.
// -----------------------------------------------------------------------------------------
import React from 'react';
import classes from './Card.module.css'
const Card = (props) => {
    return (
        <div className={classes.card}>
            {props.children}
        </div>
    );
};

export default Card;